package com.example.teoat.data

object RegionData {
    // 지역 코드 맵
    // 경기데이터드림에서 가져오는 API에서 지역별 구분을 숫자 코드로 하고 있어서 별도로 관리
    val regionMap = mapOf(
        "경기" to 41000L, "경기도" to 41000L,
        "가평" to 41820L, "가평군" to 41820L,
        "고양" to 41280L, "고양시" to 41280L,
        "과천" to 41290L, "과천시" to 41290L,
        "광명" to 41210L, "광명시" to 41210L,
        "광주" to 41610L, "광주시" to 41610L,
        "구리" to 41310L, "구리시" to 41310L,
        "군포" to 41410L, "군포시" to 41410L,
        "김포" to 41570L, "김포시" to 41570L,
        "남양주" to 41360L, "남양주시" to 41360L,
        "동두천" to 41250L, "동두천시" to 41250L,
        "부천" to 41190L, "부천시" to 41190L,
        "성남" to 41130L, "성남시" to 41130L,
        "수원" to 41110L, "수원시" to 41110L,
        "시흥" to 41390L, "시흥시" to 41390L,
        "안산" to 41270L, "안산시" to 41270L,
        "안성" to 41550L, "안성시" to 41550L,
        "안양" to 41170L, "안양시" to 41170L,
        "양주" to 41630L, "양주시" to 41630L,
        "양평" to 41830L, "양평군" to 41830L,
        "여주" to 41670L, "여주시" to 41670L,
        "연천" to 41800L, "연천군" to 41800L,
        "오산" to 41370L, "오산시" to 41370L,
        "용인" to 41460L, "용인시" to 41460L,
        "의왕" to 41430L, "의왕시" to 41430L,
        "의정부" to 41150L, "의정부시" to 41150L,
        "이천" to 41500L, "이천시" to 41500L,
        "파주" to 41480L, "파주시" to 41480L,
        "평택" to 41220L, "평택시" to 41220L,
        "포천" to 41650L, "포천시" to 41650L,
        "하남" to 41450L, "하남시" to 41450L,
        "화성" to 41590L, "화성시" to 41590L
    )
}